import { LegalPageLayout } from "./components/LegalPageLayout";

function BarnalPrivacyPolicy() {
  return (
    <LegalPageLayout appName="Barnal" backPath="/barnal">
      <h1 id="プライバシーポリシー">プライバシーポリシー</h1>
      <p>
        Hiroki Asano（以下「当方」といいます。）は、当方が提供する「Barnal –
        Menu bar
        journal」における、ユーザーについての個人情報を含む利用者情報の取扱いについて、以下のとおりプライバシーポリシー（以下「本ポリシー」といいます。）を定めます。
      </p>
      <h2 id="収集する利用者情報及び収集方法">
        収集する利用者情報及び収集方法
      </h2>
      <p>
        本ポリシーにおいて、「利用者情報」とは、ユーザーの識別に係る情報、通信サービス上の行動履歴、その他ユーザーまたはユーザーの端末に関連して生成または蓄積された情報であって、本ポリシーに基づき当方が収集するものを意味するものとします。本サービスにおいて当方が収集する利用者情報は、その収集方法に応じて、以下のようなものとなります。
      </p>
      <ol type="1">
        <li>本サービスでは利用者情報の収集を行なっていません。</li>
      </ol>
      <h2 id="お問い合わせ窓口">お問い合わせ窓口</h2>
      <p>
        本サービスに対するご意見、ご質問、苦情のお申出その他利用者情報の取扱いに関するお問い合わせは、下記の窓口までお願いいたします。
      </p>
      <p>asano.hiroki@gmail.com</p>
      <h2 id="プライバシーポリシーの変更手続">
        プライバシーポリシーの変更手続
      </h2>
      <p>
        当方は、必要に応じて、本ポリシーを変更します。但し、法令上ユーザーの同意が必要となるような本ポリシーの変更を行う場合、変更後の本ポリシーは、当方所定の方法で変更に同意したユーザーに対してのみ適用されるものとします。なお、当方は、本ポリシーを変更する場合には、変更後の本ポリシーの施行時期及び内容を当方のウェブサイト上での表示その他の適切な方法により周知し、またはユーザーに通知します。
      </p>
      <p>【2026年1月31日制定】</p>
    </LegalPageLayout>
  );
}

export default BarnalPrivacyPolicy;
