import { LegalPageLayout } from "./components/LegalPageLayout";

function CashCrewPrivacyPolicy() {
  return (
    <LegalPageLayout appName="CashCrew" backPath="/cashcrew">
      <h1 id="プライバシーポリシー">プライバシーポリシー</h1>
      <p>
        Hiroki Asano（以下「当方」といいます。）は、当方が提供する「CashCrew -
        将来のお金の動きがわかる家計簿」（以下「本サービス」といいます。）における、ユーザーについての個人情報を含む利用者情報の取扱いについて、以下のとおりプライバシーポリシー（以下「本ポリシー」といいます。）を定めます。
      </p>
      <h2 id="収集する利用者情報及び収集方法">
        収集する利用者情報及び収集方法
      </h2>
      <p>
        本ポリシーにおいて、「利用者情報」とは、ユーザーの識別に係る情報、通信サービス上の行動履歴、その他ユーザーまたはユーザーの端末に関連して生成または蓄積された情報であって、本ポリシーに基づき当方が収集するものを意味するものとします。本サービスにおいて当方が収集する利用者情報は、その収集方法に応じて、以下のようなものとなります。
      </p>
      <ol type="1">
        <li>
          ユーザーからお問い合わせやご意見を頂く際に、当方がユーザーの個別同意に基づいて収集する情報
          <ol type="1">
            <li>送信元のメールアドレス</li>
            <li>
              端末を識別する情報（デバイス情報、OSバージョン情報、アプリバージョン情報）
            </li>
            <li>お問い合わせ内容</li>
          </ol>
        </li>
        <li>
          ユーザーの利用状況解析のために、個人を特定しない形で収集する情報
          <ol type="1">
            <li>
              Google Firebase
              Analyticsにより収集される情報。取得する情報、利用目的、第三者への提供等の詳細につきましては、Google
              プライバシーポリシー（https://policies.google.com/privacy?hl=ja）をご確認ください。
            </li>
          </ol>
        </li>
        <li>
          広告配信のために、個人を特定しない形で収集する情報
          <ol type="1">
            <li>
              広告IDを含む、Google
              AdMobにより収集される情報。取得する情報、利用目的、第三者への提供等の詳細につきましては、Google
              プライバシーポリシーの広告についてのページ（https://policies.google.com/technologies/ads?hl=ja）をご確認ください。
            </li>
          </ol>
        </li>
      </ol>
      <h2 id="利用目的">利用目的</h2>
      <p>
        本サービスのサービス提供にかかわる利用者情報の具体的な利用目的は以下のとおりです。
      </p>
      <ul>
        <li>お問い合わせ・ご意見に対する返信のため</li>
        <li>本サービスの品質向上のため</li>
      </ul>
      <h2 id="第三者提供">第三者提供</h2>
      <ol type="1">
        <li>
          当方は、利用者情報のうち、個人情報については、あらかじめユーザーの同意を得ないで、第三者に提供しません。但し、次に掲げる必要があり第三者に提供する場合はこの限りではありません。
          <ol type="1">
            <li>
              当方が利用目的の達成に必要な範囲内において個人情報の取扱いの全部または一部を委託する場合
            </li>
            <li>
              合併その他の事由による事業の承継に伴って個人情報が提供される場合
            </li>
            <li>
              その他、個人情報の保護に関する法律（以下「個人情報保護法」といいます。）その他の法令で認められる場合
            </li>
          </ol>
        </li>
        <li>
          当方は、個人情報を第三者に提供したときは、記録の作成及び保存を行います。
        </li>
        <li>
          当方は、第三者から個人情報の提供を受けるに際しては、必要な確認を行い、当該確認にかかる記録の作成及び保存を行うものとします。
        </li>
      </ol>
      <h2 id="安全管理措置">安全管理措置</h2>
      <ol type="1">
        <li>
          当方は、利用者情報の漏えい、滅失または毀損の防止その他の利用者情報の安全管理のために、必要かつ適切な措置を講じます。
        </li>
        <li>
          当方は、利用者情報のうち個人情報の取扱いを第三者に委託する場合には、当方が定める委託先選定基準を満たす事業者を選定し、委託契約を締結した上で定期的に報告を受ける等の方法により、委託先事業者による個人情報の取扱いについて把握します。
        </li>
        <li>
          当方が講じる安全管理措置の具体的な内容については、本プライバシーポリシーに記載の当方のお問合せ窓口にお問い合わせください。
        </li>
      </ol>
      <h2 id="個人情報の開示等の請求">個人情報の開示等の請求</h2>
      <ol type="1">
        <li>
          当方は、ユーザーから、個人情報保護法の定めに基づき保有個人データの利用目的の通知、保有個人データ又は第三者提供の記録の開示、保有個人データの内容の訂正・追加・削除、保有個人データの利用の停止・消去・第三者提供の停止のご請求（あわせて以下「個人情報の開示等の請求」といいます。）があった場合は、ユーザーご本人からのご請求であることを確認した上で、当方所定の手続きに従い、遅滞なくこれらに対応いたします。
        </li>
        <li>
          個人情報の開示等の請求につきましては、手数料としてご請求1件につき1,000円（消費税別）をお支払いいただきます。
        </li>
        <li>
          個人情報の開示等の請求の具体的な方法については、本プライバシーポリシーに記載の当方のお問い合わせ窓口にお問い合わせください。
        </li>
      </ol>
      <h2 id="お問い合わせ窓口">お問い合わせ窓口</h2>
      <p>
        本サービスに対するご意見、ご質問、苦情のお申出その他利用者情報の取扱いに関するお問い合わせは、下記の窓口までお願いいたします。
      </p>
      <p>asano.hiroki@gmail.com</p>
      <h2 id="プライバシーポリシーの変更手続">
        プライバシーポリシーの変更手続
      </h2>
      <p>
        当方は、必要に応じて、本ポリシーを変更します。但し、法令上ユーザーの同意が必要となるような本ポリシーの変更を行う場合、変更後の本ポリシーは、当方所定の方法で変更に同意したユーザーに対してのみ適用されるものとします。なお、当方は、本ポリシーを変更する場合には、変更後の本ポリシーの施行時期及び内容を当方のウェブサイト上での表示その他の適切な方法により周知し、またはユーザーに通知します。
      </p>
      <p>【2026年1月18日制定】</p>
    </LegalPageLayout>
  );
}

export default CashCrewPrivacyPolicy;
